import { ISuppliers, ITender, ITendersList } from '../types/models';

export const federal = ['223-ФЗ', '44-ФЗ'];
export const stages = [
  'Подача заявок',
  'Работа комиссии',
  'Закупка отменена',
  'Закупка завершена',
];
export const tags: string[] = ['js', 'vuejs', 'reactjs', 'php', 'python'];
export const suppliers: ISuppliers[] = [
  {
    name: 'Электронный аукцион',
    alt_name: 'Аукцион',
  },
  {
    name: 'Открытый конкурс',
    alt_name: 'Конкурс',
  },
  {
    name: 'Запрос котировок',
    alt_name: 'Запрос котировок',
  },
];

export const tenderListSearchExamples: ITendersList = {
  length: 2,
  data: [
    {
      id: '1979',
      number: '0162300005323000613',
      name: 'Оказание комплекса услуг по разработке и реализации рекламной и PR-кампании по продвижению сайта 300.екатеринбург.рф и событийной программы 300-летия Екатеринбурга через инструменты SEO-, SMM-продвижения, digital-, репутационный и (SERM) и крауд (CRAWD)-маркетинг на протяжении 5 месяцев 2023 года',
      stage: 'Подача заявок',
      federal: '44-ФЗ',
      supplier: 'Открытый конкурс',
      price: '3500000',
      customer: 'АДМИНИСТРАЦИЯ ГОРОДА ЕКАТЕРИНБУРГА',
      placement_date: '05.04.2023',
      end_date: '21.04.2023',
    },
    {
      id: '1980',
      number: '0335200006823000024',
      name: 'Оказание услуг по разработке сайта, посвященного Году педагога и наставника в Калининградской области',
      stage: 'Подача заявок',
      federal: '44-ФЗ',
      supplier: 'Запрос котировок',
      price: '814666.67',
      customer:
        'ГОСУДАРСТВЕННОЕ АВТОНОМНОЕ УЧРЕЖДЕНИЕ КАЛИНИНГРАДСКОЙ ОБЛАСТИ ДОПОЛНИТЕЛЬНОГО ПРОФЕССИОНАЛЬНОГО ОБРАЗОВАНИЯ  "ИНСТИТУТ РАЗВИТИЯ ОБРАЗОВАНИЯ"',
      placement_date: '04.04.2023',
      end_date: '11.04.2023',
    },
  ],
  isRelevance: false,
};

export const tenderListAnalysysExamples: ITendersList = {
  link: '/reports/NoneDoc_4uMzCNn.pdf',
  length: 2,
  data: [
    {
      id: '1979',
      number: '0162300005323000613',
      name: 'Оказание комплекса услуг по разработке и реализации рекламной и PR-кампании по продвижению сайта 300.екатеринбург.рф и событийной программы 300-летия Екатеринбурга через инструменты SEO-, SMM-продвижения, digital-, репутационный и (SERM) и крауд (CRAWD)-маркетинг на протяжении 5 месяцев 2023 года',
      stage: 'Подача заявок',
      federal: '44-ФЗ',
      supplier: 'Открытый конкурс',
      price: '3500000',
      customer: 'АДМИНИСТРАЦИЯ ГОРОДА ЕКАТЕРИНБУРГА',
      placement_date: '05.04.2023',
      end_date: '21.04.2023',
      relevance: 1.3066153973340988,
    },
    {
      id: '1980',
      number: '0335200006823000024',
      name: 'Оказание услуг по разработке сайта, посвященного Году педагога и наставника в Калининградской области',
      stage: 'Подача заявок',
      federal: '44-ФЗ',
      supplier: 'Запрос котировок',
      price: '814666.67',
      customer:
        'ГОСУДАРСТВЕННОЕ АВТОНОМНОЕ УЧРЕЖДЕНИЕ КАЛИНИНГРАДСКОЙ ОБЛАСТИ ДОПОЛНИТЕЛЬНОГО ПРОФЕССИОНАЛЬНОГО ОБРАЗОВАНИЯ  "ИНСТИТУТ РАЗВИТИЯ ОБРАЗОВАНИЯ"',
      placement_date: '04.04.2023',
      end_date: '11.04.2023',
      relevance: 0.04466047685127705,
    },
  ],
  isRelevance: false,
};

export const tenderInfoExample: ITender = {
  id: '1177',
  number: '0163200000314000099',
  name: 'Внешний жесткий (магнитный) диск, вебкамера',
  stage: 'Работа комиссии',
  federal: '44-ФЗ',
  supplier: 'Электронный аукцион',
  price: '17238',
  customer: 'Главное управление государственного заказа Смоленской области',
  placement_date: '27.02.2014',
  end_date: '07.03.2014',
  documents: [
    {
      title: 'Проект_ГК.doc',
      document:
        '/media/docs/0163200000314000099/%D0%9F%D1%80%D0%BE%D0%B5%D0%BA%D1%82_%D0%93%D0%9A.doc',
    },
    {
      title: 'Титульный_лист.docx',
      document:
        '/media/docs/0163200000314000099/%D0%A2%D0%B8%D1%82%D1%83%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D0%BB%D0%B8%D1%81%D1%82.docx',
    },
    {
      title: '0._Извещение_о_проведении_электронного_аукциона.docx',
      document:
        '/media/docs/0163200000314000099/0._%D0%98%D0%B7%D0%B2%D0%B5%D1%89%D0%B5%D0%BD%D0%B8%D0%B5_%D0%BE_%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B8_%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE_%D0%B0%D1%83%D0%BA%D1%86%D0%B8%D0%BE%D0%BD%D0%B0.docx',
    },
    {
      title: '1._Инструкция_участникам_закупки_НОВАЯ.doc',
      document:
        '/media/docs/0163200000314000099/1._%D0%98%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D0%B8%D1%8F_%D1%83%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%B8%D0%BA%D0%B0%D0%BC_%D0%B7%D0%B0%D0%BA%D1%83%D0%BF%D0%BA%D0%B8_%D0%9D%D0%9E%D0%92%D0%90%D0%AF.doc',
    },
    {
      title: '2._Информационная_карта.docx',
      document:
        '/media/docs/0163200000314000099/2._%D0%98%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D0%B0%D1%8F_%D0%BA%D0%B0%D1%80%D1%82%D0%B0.docx',
    },
    {
      title: 'Прил_№_1_к_Информкарте.doc',
      document:
        '/media/docs/0163200000314000099/%D0%9F%D1%80%D0%B8%D0%BB__1_%D0%BA_%D0%98%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%BA%D0%B0%D1%80%D1%82%D0%B5.doc',
    },
    {
      title: 'Прил_№_2_к_Информкарте.doc',
      document:
        '/media/docs/0163200000314000099/%D0%9F%D1%80%D0%B8%D0%BB__2_%D0%BA_%D0%98%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%BA%D0%B0%D1%80%D1%82%D0%B5.doc',
    },
  ],
};
